电脑/linux/鸟哥的私房菜学习笔记.md
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 前言</a></li>
<li><a href="#orgheadline2">2. sync命令</a></li>
<li><a href="#orgheadline3">3. 忘记root密码</a></li>
<li><a href="#orgheadline4">4. <code>$PATH</code> 变量</a></li>
<li><a href="#orgheadline7">5. 连接文件</a>
<ul>
<li><a href="#orgheadline5">5.1. 硬连接</a></li>
<li><a href="#orgheadline6">5.2. 符号连接</a></li>
</ul>
</li>
</ul>
</div>
</nav>


# 前言<a id="orgheadline1"></a>

本文由学习有名的鸟哥的linux私房菜一书，查漏补缺，汇集而成。

# sync命令<a id="orgheadline2"></a>

将数据同步写入硬盘，shutdown，reboot，halt命令都自动进行了sync操作。

# 忘记root密码<a id="orgheadline3"></a>

系统重启进入菜单选项是，按 `e` 进入grub的编辑模式，然后在kenerl那一行再按 `e` 编辑该行，行尾加上 `single` ，然后 Enter确认，然后按 `b` 进入单用户维护模式，然后用 `passwd` 命令来修改root密码。

# `$PATH` 变量<a id="orgheadline4"></a>

当我们输入ls命令，其能够找到对应的可执行文件是参考了 `$PATH` 这个变量的搜索路径。

读者可以激活一个python的虚拟环境来看看这个变量的变化。

    echo $PATH

# 连接文件<a id="orgheadline7"></a>

## 硬连接<a id="orgheadline5"></a>

文件名只与目录有关，而具体对应的文件内容与inode有关，所有硬连接是指在某个目录下新建一个文件名连接到某个具体的inode上，然后由这个inode对应具体的文件。

硬连接不能跨文件系统，不能连接目录。

## 符号连接<a id="orgheadline6"></a>

符号连接就相当于新建一个快捷方式文件。由于硬连接有其局限，比如不能连接目录，所以实践中常用的是符号连接。

ln命令默认创建硬链接，加入 `-s` 参数是创建符号连接。

    ln -s 源文件 目标文件